# Gal Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Gal Property
SymbolTypeId Class See Also
---
Symbol gal, indicating unit US gallons.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Gal { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Gal As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Gal {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace